Autodesk.Revit.DB.TransmissionData.DocumentIsNotTransmitted(Autodesk.Revit.DB.ModelPath)
Determines whether the document at a given file location
is not transmitted.
filePath:
The path to the document whose transmitted state will be checked.
Returns:
False if the document is a transmitted file, true otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.TransmissionData.IsDocumentTransmitted(Autodesk.Revit.DB.ModelPath)
Determines whether the document at a given file location
is transmitted.
filePath:
The path to the document whose transmitted state will be checked.
Returns:
True if the document is a transmitted file, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.TransmissionData.WriteTransmissionData(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.TransmissionData)
Writes the given TransmissionData into the Revit file at the
given location.
Remarks:
This function will overwrite the existing TransmissionData
in the file.
This function will not support models on Revit Server. References
may be to Revit Server, but the host model must be local.
This function must be called on a closed document.
This function cannot be used to convert a reference from
a local file to an external server.
path:
A ModelPath indicating the file Revit should write
the TransmissionData of.
This ModelPath must be a file path and an absolute path.
data:
The TransmissionData to be written into the document.
Note that Revit will not check that the ElementIds in
the TransmissionData correspond to real Elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at path's location
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Operation is not valid for Revit Server models.
-or-
This function cannot be called on an opened document.
Since:
2012

Autodesk.Revit.DB.TransmissionData.ReadTransmissionData(Autodesk.Revit.DB.ModelPath)
Reads the TransmissionData associated with the
file at the given location.
Remarks:
The TransmissionData returned by this function contains
data about all ExternalFileReferences in the document.
ExternalResourceReferences to extenal servers will not
be returned by this function. TransmissionData contains
information about local or Revit Server references only.
path:
A ModelPath indicating the file Revit should read
the TransmissionData of.
If this ModelPath is a file path, it must be an absolute path.
Returns:
The TransmissionData containing external file
information for the file at the given location.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model are locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at path's location
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Since:
2012

Autodesk.Revit.DB.TransmissionData.SetDesiredReferenceData(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.PathType,System.Boolean)
Sets the ExternalFileReference information which
Revit should use the next time it opens the document
which this TransmissionData belongs to.
Remarks:
There must already be a reference associated with
the given id for this function to be valid. New
references cannot be created in a closed file.
See the documentation for a particular reference
type to see its creation API.
elemId:
The id of the element associated with this reference.
path:
A ModelPath indicating the location to load the external
file reference from.
pathType:
A PathType value indicating what type of path the ModelPath is.
shouldLoad:
True if the external file should be loaded the next time Revit
opens the document. False if it should be unloaded.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elemId does not correspond to an ExternalFileReference
contained in this TransmissionData.
-or-
These inputs will not produce a valid ExternalFileReference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.TransmissionData.GetDesiredReferenceData(Autodesk.Revit.DB.ElementId)
Gets the ExternalFileReference representing path
and load status information to be used the next time
this TransmissionData's document is loaded.
elemId:
The ElementId of the Element which the external file
reference is a component of.
Returns:
An ExternalFileReference containing the requested
path and load status information for an external file
Throws Autodesk.Revit.Exceptions.ArgumentException:
elemId does not correspond to an ExternalFileReference
contained in this TransmissionData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.TransmissionData.GetLastSavedReferenceData(Autodesk.Revit.DB.ElementId)
Gets the ExternalFileReference representing path
and load status information concerning the most
recent time this TransmissionData's document was opened.
elemId:
The ElementId of the Element which the external file
reference is a component of.
Returns:
An ExternalFileReference containing the previous
path and load status information for an external file
Throws Autodesk.Revit.Exceptions.ArgumentException:
elemId does not correspond to an ExternalFileReference
contained in this TransmissionData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.TransmissionData.GetAllExternalFileReferenceIds
Gets the ids of all ExternalFileReferences.
Returns:
The ids of all ExternalFileReferences.
Since:
2012

Autodesk.Revit.DB.TransmissionData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TransmissionData.Version
The format version for TransmissionData
Since:
2012

Autodesk.Revit.DB.TransmissionData.UserData
A string which users can store notes in.
Remarks:
Revit merely stores this data; it is never used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.TransmissionData.IsTransmitted
Determines whether this file has been transmitted or not.
Remarks:
"Transmitted" files have been moved from one place to another and
are considered to be in a not-final state. Revit will read the
TransmissionData on file open and overwrite any data stored in the
external file reference elements themselves.
Since:
2012

Autodesk.Revit.DB.TransmissionData.#ctor(Autodesk.Revit.DB.TransmissionData)
Constructs a TransmissionData from another TransmissionData
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.TransmissionData
A class representing information on all external file references
in a document.
Remarks:
TransmissionData stores information on both the previous state
and requested state of an external file reference.
This means that it stores the load state and path of the reference
from the most recent time this TransmissionData's document was opened.
It also stores load state and path information for what Revit should
do the next time the document is opened.
As such, TransmissionData can be used to perform operations on external
file references without having to open the entire associated Revit
document. The methods ReadTransmissionData and WriteTransmissionData
can be used to obtain information about external references, or to
change that information. For example, calling WriteTransmissionData
with a TransmissionData object which has had all references set to
LinkedFileStatus.Unloaded would cause no references to be loaded
upon next opening the document.
TransmissionData cannot add or remove references to
external files. If, on file open, Revit discovers information
in the TransmissionData which does not correspond to an
existing external file reference,
the information will be ignored on file load.
The TransmissionData for a document does not contain information
about references which come from external servers. TransmissionData only
contains references to local files or Revit links on Revit Server.
TransmissionData cannot
be used to change a reference from a local file reference to an external
server reference.
Note that TransmissionData objects must be set to "transmitted" for
the requested reference data to be meaningful. Revit ignores the
TransmissionData for non-transmitted files. Marking a file as
transmitted has other effects - workshared files are opened as
detached from the central model, and creation of new local files
is prohibited, until the file is in its final location and the
file has been marked as no longer transmitted.
Since:
2012